### Plan for staging
🟢 Add module.event_sourcing.aws_cloudwatch_log_group.firehose_direct_log_group["AbTestChangeEvent"]
🟢 Add module.event_sourcing.aws_cloudwatch_log_group.firehose_direct_log_group["AbTestParticipantAllocationEvent"]
🟢 Add module.event_sourcing.aws_cloudwatch_log_stream.firehose_direct_log_stream["AbTestChangeEvent"]
🟢 Add module.event_sourcing.aws_cloudwatch_log_stream.firehose_direct_log_stream["AbTestParticipantAllocationEvent"]
🟢 Add module.event_sourcing.aws_glue_schema.event_glue_schema["AbTestChangeEvent"]
🟢 Add module.event_sourcing.aws_glue_schema.event_glue_schema["AbTestParticipantAllocationEvent"]
🟢 Add module.event_sourcing.aws_iam_policy.firehose_outgoing_permissions_policy["AbTestChangeEvent"]
🟢 Add module.event_sourcing.aws_iam_policy.firehose_outgoing_permissions_policy["AbTestParticipantAllocationEvent"]
🟢 Add module.event_sourcing.aws_iam_policy.service_additional_permissions
🟢 Add module.event_sourcing.aws_iam_role.firehose_outgoing_role["AbTestChangeEvent"]
🟢 Add module.event_sourcing.aws_iam_role.firehose_outgoing_role["AbTestParticipantAllocationEvent"]
🟢 Add module.event_sourcing.aws_iam_role_policy_attachment.firehose_outgoing_role_policy_attachment["AbTestChangeEvent"]
🟢 Add module.event_sourcing.aws_iam_role_policy_attachment.firehose_outgoing_role_policy_attachment["AbTestParticipantAllocationEvent"]
🟢 Add module.event_sourcing.aws_iam_role_policy_attachment.service_additional_permissions
🟢 Add module.event_sourcing.aws_kinesis_firehose_delivery_stream.firehose_direct_delivery_stream["AbTestChangeEvent"]
🟢 Add module.event_sourcing.aws_kinesis_firehose_delivery_stream.firehose_direct_delivery_stream["AbTestParticipantAllocationEvent"]
🟢 Add module.event_sourcing.aws_s3_bucket_notification.bucket_notifications
🟢 Add module.event_sourcing.null_resource.update_checkpoint["AbTestChangeEvent"]
🟢 Add module.event_sourcing.null_resource.update_checkpoint["AbTestParticipantAllocationEvent"]
🟢 Add module.event_sourcing.module.pipe["AbTestChangeEvent"].snowflake_pipe.this
🟢 Add module.event_sourcing.module.pipe["AbTestParticipantAllocationEvent"].snowflake_pipe.this
🟢 Add module.event_sourcing.module.s3_bucket_event_sourcing_producer.aws_s3_bucket.bucket
🟢 Add module.event_sourcing.module.s3_bucket_event_sourcing_producer.aws_s3_bucket_lifecycle_configuration.lifecycle_configuration[0]
🟢 Add module.event_sourcing.module.s3_bucket_event_sourcing_producer.aws_s3_bucket_ownership_controls.ownership[0]
🟢 Add module.event_sourcing.module.s3_bucket_event_sourcing_producer.aws_s3_bucket_server_side_encryption_configuration.server_side_encryption
🟢 Add module.event_sourcing.module.s3_bucket_event_sourcing_producer.aws_s3_bucket_versioning.versioning[0]
🟢 Add module.event_sourcing.module.stage.snowflake_stage.this
🟢 Add module.event_sourcing.module.table["AbTestChangeEvent"].snowflake_table.this
🟢 Add module.event_sourcing.module.table["AbTestParticipantAllocationEvent"].snowflake_table.this
🟠 Replace module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition

**29 to add, 0 to modify, 1 to replace, 0 to delete**

<details><summary>Show detailed plan</summary>

```terraform
Terraform will perform the following actions:

  # module.event_sourcing.data.aws_iam_policy_document.firehose_outgoing_permissions["AbTestChangeEvent"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "firehose_outgoing_permissions" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "glue:GetTableVersions",
              + "s3:AbortMultipartUpload",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:ListBucketMultipartUploads",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "glue:GetTableVersions",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:GetFunctionConfiguration",
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:eu-west-1:545209064596:function:event-deserialise:$LATEST",
            ]
        }
    }

  # module.event_sourcing.data.aws_iam_policy_document.firehose_outgoing_permissions["AbTestParticipantAllocationEvent"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "firehose_outgoing_permissions" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "glue:GetTableVersions",
              + "s3:AbortMultipartUpload",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:ListBucketMultipartUploads",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "glue:GetTableVersions",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:GetFunctionConfiguration",
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:eu-west-1:545209064596:function:event-deserialise:$LATEST",
            ]
        }
    }

  # module.event_sourcing.data.aws_iam_policy_document.service_additional_permissions_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "service_additional_permissions_document" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "glue:GetTableVersions",
              + "s3:AbortMultipartUpload",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:ListBucketMultipartUploads",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "glue:GetSchemaByDefinition",
              + "glue:GetTableVersions",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "firehose:DeleteDeliveryStream",
              + "firehose:PutRecord",
              + "firehose:PutRecordBatch",
              + "firehose:UpdateDestination",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "firehose:DeleteDeliveryStream",
              + "firehose:PutRecord",
              + "firehose:PutRecordBatch",
              + "firehose:UpdateDestination",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.event_sourcing.aws_cloudwatch_log_group.firehose_direct_log_group["AbTestChangeEvent"] will be created
  + resource "aws_cloudwatch_log_group" "firehose_direct_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "ab-testing-abtestchangeevent-firehose-direct-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "ab-testing"
          + "team"           = "multi-product"
        }
    }

  # module.event_sourcing.aws_cloudwatch_log_group.firehose_direct_log_group["AbTestParticipantAllocationEvent"] will be created
  + resource "aws_cloudwatch_log_group" "firehose_direct_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "ab-testing-abtestparticipantallocationevent-firehose-direct-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "ab-testing"
          + "team"           = "multi-product"
        }
    }

  # module.event_sourcing.aws_cloudwatch_log_stream.firehose_direct_log_stream["AbTestChangeEvent"] will be created
  + resource "aws_cloudwatch_log_stream" "firehose_direct_log_stream" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "ab-testing-abtestchangeevent-firehose-direct-logs"
      + name           = "ab-testing-abtestchangeevent-firehose-direct-log-stream"
    }

  # module.event_sourcing.aws_cloudwatch_log_stream.firehose_direct_log_stream["AbTestParticipantAllocationEvent"] will be created
  + resource "aws_cloudwatch_log_stream" "firehose_direct_log_stream" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "ab-testing-abtestparticipantallocationevent-firehose-direct-logs"
      + name           = "ab-testing-abtestparticipantallocationevent-firehose-direct-log-stream"
    }

  # module.event_sourcing.aws_glue_schema.event_glue_schema["AbTestChangeEvent"] will be created
  + resource "aws_glue_schema" "event_glue_schema" {
      + arn                   = (known after apply)
      + compatibility         = "BACKWARD"
      + data_format           = "JSON"
      + id                    = (known after apply)
      + latest_schema_version = (known after apply)
      + next_schema_version   = (known after apply)
      + registry_arn          = "arn:aws:glue:eu-west-1:545209064596:registry/automotive"
      + registry_name         = (known after apply)
      + schema_checkpoint     = (known after apply)
      + schema_definition     = jsonencode(
            {
              + "$schema"  = "http://json-schema.org/draft-07/schema#"
              + properties = {
                  + eventData       = {
                      + allOf = [
                          + {
                              + description = "Changing Ab Test Event data."
                              + properties  = {
                                  + abChangeType              = {
                                      + description = "The type of change that has occurred"
                                      + enum        = [
                                          + "STARTED",
                                          + "DISTRIBUTION_CHANGE",
                                          + "SEGMENT_CHANGE",
                                          + "COMPLETED",
                                          + "REALLOCATED",
                                        ]
                                      + type        = "string"
                                    }
                                  + latestReallocationVersion = {
                                      + description = "Does the version ."
                                      + type        = "integer"
                                    }
                                  + testGroups                = {
                                      + description = "Current Groups and Weightings for the test"
                                      + items       = {
                                          + properties = {
                                              + name      = {
                                                  + type = "string"
                                                }
                                              + weighting = {
                                                  + type = "string"
                                                }
                                            }
                                          + type       = "object"
                                        }
                                      + type        = "array"
                                    }
                                }
                              + type        = "object"
                            },
                          + {
                              + description = "The event payload."
                            },
                        ]
                    }
                  + eventTime       = {
                      + description = "When the event occurred."
                      + type        = "string"
                    }
                  + metadata        = {
                      + description = "Metadata used by producer library to identify the event."
                      + properties  = {
                          + event_id    = {
                              + description = "unique id for the event."
                              + type        = "string"
                            }
                          + event_type  = {
                              + description = "the type of event."
                              + type        = "string"
                            }
                          + occurred_at = {
                              + description = "The time the event occurred at/was first produced."
                              + type        = "string"
                            }
                          + service     = {
                              + description = "the service provider"
                              + type        = "string"
                            }
                        }
                      + type        = "object"
                    }
                  + resourceId      = {
                      + description = "The ID of the quote."
                      + type        = "string"
                    }
                  + resourceVersion = {
                      + description = "The version of the quote after the event has been applied."
                      + type        = "integer"
                    }
                }
              + type       = "object"
            }
        )
      + schema_name           = "AbTestChangeEvent"
      + tags_all              = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "ab-testing"
          + "team"           = "multi-product"
        }
    }

  # module.event_sourcing.aws_glue_schema.event_glue_schema["AbTestParticipantAllocationEvent"] will be created
  + resource "aws_glue_schema" "event_glue_schema" {
      + arn                   = (known after apply)
      + compatibility         = "BACKWARD"
      + data_format           = "JSON"
      + id                    = (known after apply)
      + latest_schema_version = (known after apply)
      + next_schema_version   = (known after apply)
      + registry_arn          = "arn:aws:glue:eu-west-1:545209064596:registry/automotive"
      + registry_name         = (known after apply)
      + schema_checkpoint     = (known after apply)
      + schema_definition     = jsonencode(
            {
              + "$schema"  = "http://json-schema.org/draft-07/schema#"
              + properties = {
                  + eventData       = {
                      + allOf = [
                          + {
                              + description = "Saving Ab Test Participant Event data."
                              + properties  = {
                                  + testGrouping = {
                                      + type = "string"
                                    }
                                  + testId       = {
                                      + description = "List of deeplinked addons for the quote."
                                      + type        = "string"
                                    }
                                  + testVersion  = {
                                      + type = "integer"
                                    }
                                }
                              + type        = "object"
                            },
                          + {
                              + description = "The event payload."
                            },
                        ]
                    }
                  + eventTime       = {
                      + description = "When the event occurred."
                      + type        = "string"
                    }
                  + metadata        = {
                      + description = "Metadata used by producer library to identify the event."
                      + properties  = {
                          + event_id    = {
                              + description = "unique id for the event."
                              + type        = "string"
                            }
                          + event_type  = {
                              + description = "the type of event."
                              + type        = "string"
                            }
                          + occurred_at = {
                              + description = "The time the event occurred at/was first produced."
                              + type        = "string"
                            }
                          + service     = {
                              + description = "the service provider"
                              + type        = "string"
                            }
                        }
                      + type        = "object"
                    }
                  + resourceId      = {
                      + description = "The ID of the quote."
                      + type        = "string"
                    }
                  + resourceVersion = {
                      + description = "The version of the quote after the event has been applied."
                      + type        = "integer"
                    }
                }
              + type       = "object"
            }
        )
      + schema_name           = "AbTestParticipantAllocationEvent"
      + tags_all              = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "ab-testing"
          + "team"           = "multi-product"
        }
    }

  # module.event_sourcing.aws_iam_policy.firehose_outgoing_permissions_policy["AbTestChangeEvent"] will be created
  + resource "aws_iam_policy" "firehose_outgoing_permissions_policy" {
      + arn         = (known after apply)
      + description = "Allows firehose to access specified AWS resources to process outgoing data"
      + id          = (known after apply)
      + name        = "ab-testing-abtestchangeevent-firehose-outgoing-permissions-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "ab-testing"
          + "team"           = "multi-product"
        }
    }

  # module.event_sourcing.aws_iam_policy.firehose_outgoing_permissions_policy["AbTestParticipantAllocationEvent"] will be created
  + resource "aws_iam_policy" "firehose_outgoing_permissions_policy" {
      + arn         = (known after apply)
      + description = "Allows firehose to access specified AWS resources to process outgoing data"
      + id          = (known after apply)
      + name        = "ab-testing-abtestparticipantallocationevent-firehose-outgoing-permissions-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "ab-testing"
          + "team"           = "multi-product"
        }
    }

  # module.event_sourcing.aws_iam_policy.service_additional_permissions will be created
  + resource "aws_iam_policy" "service_additional_permissions" {
      + arn         = (known after apply)
      + description = "Allows firehose to access specified AWS resources to process outgoing data"
      + id          = (known after apply)
      + name        = "ab-testing-anayltics-permissions-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "ab-testing"
          + "team"           = "multi-product"
        }
    }

  # module.event_sourcing.aws_iam_role.firehose_outgoing_role["AbTestChangeEvent"] will be created
  + resource "aws_iam_role" "firehose_outgoing_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "firehose.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "abtestchangeevent-out-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "ab-testing"
          + "team"           = "multi-product"
        }
      + unique_id             = (known after apply)
    }

  # module.event_sourcing.aws_iam_role.firehose_outgoing_role["AbTestParticipantAllocationEvent"] will be created
  + resource "aws_iam_role" "firehose_outgoing_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "firehose.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "abtestparticipantallocationevent-out-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "ab-testing"
          + "team"           = "multi-product"
        }
      + unique_id             = (known after apply)
    }

  # module.event_sourcing.aws_iam_role_policy_attachment.firehose_outgoing_role_policy_attachment["AbTestChangeEvent"] will be created
  + resource "aws_iam_role_policy_attachment" "firehose_outgoing_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "abtestchangeevent-out-role"
    }

  # module.event_sourcing.aws_iam_role_policy_attachment.firehose_outgoing_role_policy_attachment["AbTestParticipantAllocationEvent"] will be created
  + resource "aws_iam_role_policy_attachment" "firehose_outgoing_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "abtestparticipantallocationevent-out-role"
    }

  # module.event_sourcing.aws_iam_role_policy_attachment.service_additional_permissions will be created
  + resource "aws_iam_role_policy_attachment" "service_additional_permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ab-testing-task-role"
    }

  # module.event_sourcing.aws_kinesis_firehose_delivery_stream.firehose_direct_delivery_stream["AbTestChangeEvent"] will be created
  + resource "aws_kinesis_firehose_delivery_stream" "firehose_direct_delivery_stream" {
      + arn            = (known after apply)
      + destination    = "extended_s3"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "event-abtestchangeevent-direct"
      + tags_all       = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "ab-testing"
          + "team"           = "multi-product"
        }
      + version_id     = (known after apply)

      + extended_s3_configuration {
          + bucket_arn          = (known after apply)
          + buffering_interval  = 900
          + buffering_size      = 128
          + compression_format  = "UNCOMPRESSED"
          + error_output_prefix = "firehose_consumer_failure/AbTestChangeEvent/!{timestamp:yyyy/MM/dd}/!{firehose:error-output-type}/"
          + prefix              = "firehose_consumer_success/AbTestChangeEvent/!{partitionKeyFromLambda:eventDate}/"
          + role_arn            = (known after apply)
          + s3_backup_mode      = "Disabled"

          + cloudwatch_logging_options {
              + enabled         = true
              + log_group_name  = "ab-testing-abtestchangeevent-firehose-direct-logs"
              + log_stream_name = "ab-testing-abtestchangeevent-firehose-direct-log-stream"
            }

          + dynamic_partitioning_configuration {
              + enabled        = true
              + retry_duration = 300
            }

          + processing_configuration {
              + enabled = true

              + processors {
                  + type = "Lambda"

                  + parameters {
                      + parameter_name  = "LambdaArn"
                      + parameter_value = "arn:aws:lambda:eu-west-1:545209064596:function:event-deserialise:$LATEST"
                    }
                  + parameters {
                      + parameter_name  = "BufferSizeInMBs"
                      + parameter_value = "2"
                    }
                  + parameters {
                      + parameter_name  = "BufferIntervalInSeconds"
                      + parameter_value = "900"
                    }
                }
            }
        }
    }

  # module.event_sourcing.aws_kinesis_firehose_delivery_stream.firehose_direct_delivery_stream["AbTestParticipantAllocationEvent"] will be created
  + resource "aws_kinesis_firehose_delivery_stream" "firehose_direct_delivery_stream" {
      + arn            = (known after apply)
      + destination    = "extended_s3"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "event-abtestparticipantallocationevent-direct"
      + tags_all       = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "ab-testing"
          + "team"           = "multi-product"
        }
      + version_id     = (known after apply)

      + extended_s3_configuration {
          + bucket_arn          = (known after apply)
          + buffering_interval  = 900
          + buffering_size      = 128
          + compression_format  = "UNCOMPRESSED"
          + error_output_prefix = "firehose_consumer_failure/AbTestParticipantAllocationEvent/!{timestamp:yyyy/MM/dd}/!{firehose:error-output-type}/"
          + prefix              = "firehose_consumer_success/AbTestParticipantAllocationEvent/!{partitionKeyFromLambda:eventDate}/"
          + role_arn            = (known after apply)
          + s3_backup_mode      = "Disabled"

          + cloudwatch_logging_options {
              + enabled         = true
              + log_group_name  = "ab-testing-abtestparticipantallocationevent-firehose-direct-logs"
              + log_stream_name = "ab-testing-abtestparticipantallocationevent-firehose-direct-log-stream"
            }

          + dynamic_partitioning_configuration {
              + enabled        = true
              + retry_duration = 300
            }

          + processing_configuration {
              + enabled = true

              + processors {
                  + type = "Lambda"

                  + parameters {
                      + parameter_name  = "LambdaArn"
                      + parameter_value = "arn:aws:lambda:eu-west-1:545209064596:function:event-deserialise:$LATEST"
                    }
                  + parameters {
                      + parameter_name  = "BufferSizeInMBs"
                      + parameter_value = "2"
                    }
                  + parameters {
                      + parameter_name  = "BufferIntervalInSeconds"
                      + parameter_value = "900"
                    }
                }
            }
        }
    }

  # module.event_sourcing.aws_s3_bucket_notification.bucket_notifications will be created
  + resource "aws_s3_bucket_notification" "bucket_notifications" {
      + bucket      = "marshmallow-event-sourcing-ab-testing-staging"
      + eventbridge = false
      + id          = (known after apply)

      + queue {
          + events        = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix = "firehose_consumer_success/AbTestChangeEvent/"
          + id            = "snowflake_AbTestChangeEvent"
          + queue_arn     = (known after apply)
        }
      + queue {
          + events        = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix = "firehose_consumer_success/AbTestParticipantAllocationEvent/"
          + id            = "snowflake_AbTestParticipantAllocationEvent"
          + queue_arn     = (known after apply)
        }
    }

  # module.event_sourcing.null_resource.update_checkpoint["AbTestChangeEvent"] will be created
  + resource "null_resource" "update_checkpoint" {
      + id       = (known after apply)
      + triggers = {
          + "always_run" = (known after apply)
        }
    }

  # module.event_sourcing.null_resource.update_checkpoint["AbTestParticipantAllocationEvent"] will be created
  + resource "null_resource" "update_checkpoint" {
      + id       = (known after apply)
      + triggers = {
          + "always_run" = (known after apply)
        }
    }

  # module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "service_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:545209064596:task-definition/ab-testing:7" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:545209064596:task-definition/ab-testing" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "DD_TRACE_SAMPLE_RATE"
                            value = "0.5"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "0.0.8-46" -> "0.0.9-47"
                        },
                        {
                            name  = "cloud.aws.credentials.instanceProfile"
                            value = "true"
                        },
                        # (5 unchanged elements hidden)
                    ]
                  ~ image            = "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.8-46" -> "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.9-47"
                  - mountPoints      = []
                    name             = "ab-testing"
                  - volumesFrom      = []
                    # (8 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints  = []
                    name         = "datadog-agent"
                  - volumesFrom  = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - environment           = []
                  - mountPoints           = []
                    name                  = "aws-for-fluent-bit"
                  - portMappings          = []
                  - volumesFrom           = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints      = []
                    name             = "envoy"
                  - portMappings     = []
                  - volumesFrom      = []
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ab-testing" -> (known after apply)
      ~ revision                 = 7 -> (known after apply)
      ~ tags                     = {
            "service" = "ab-testing"
          ~ "version" = "0.0.8-46" -> "0.0.9-47"
        }
      ~ tags_all                 = {
          ~ "version"        = "0.0.8-46" -> "0.0.9-47"
            # (6 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.event_sourcing.module.pipe["AbTestChangeEvent"].snowflake_pipe.this will be created
  + resource "snowflake_pipe" "this" {
      + auto_ingest          = true
      + copy_statement       = "copy into RAW.AUTOMOTIVE.AB_TESTING_ABTESTCHANGEEVENT from @RAW.AUTOMOTIVE.EVENT_SOURCING_AB_TESTING/firehose_consumer_success/AbTestChangeEvent/"
      + database             = "RAW"
      + error_integration    = "MARSHMALLOW_ERROR_NOTIFICATION_545209064596"
      + id                   = (known after apply)
      + name                 = "ABTESTCHANGEEVENT"
      + notification_channel = (known after apply)
      + owner                = (known after apply)
      + schema               = "AUTOMOTIVE"
    }

  # module.event_sourcing.module.pipe["AbTestParticipantAllocationEvent"].snowflake_pipe.this will be created
  + resource "snowflake_pipe" "this" {
      + auto_ingest          = true
      + copy_statement       = "copy into RAW.AUTOMOTIVE.AB_TESTING_ABTESTPARTICIPANTALLOCATIONEVENT from @RAW.AUTOMOTIVE.EVENT_SOURCING_AB_TESTING/firehose_consumer_success/AbTestParticipantAllocationEvent/"
      + database             = "RAW"
      + error_integration    = "MARSHMALLOW_ERROR_NOTIFICATION_545209064596"
      + id                   = (known after apply)
      + name                 = "ABTESTPARTICIPANTALLOCATIONEVENT"
      + notification_channel = (known after apply)
      + owner                = (known after apply)
      + schema               = "AUTOMOTIVE"
    }

  # module.event_sourcing.module.s3_bucket_event_sourcing_producer.data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = [
          + jsonencode({}),
          + (known after apply),
          + (known after apply),
        ]
    }

  # module.event_sourcing.module.s3_bucket_event_sourcing_producer.data.aws_iam_policy_document.enforce_tls_v12_or_higher will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "enforce_tls_v12_or_higher" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "enforce-tls-v12-or-higher"

          + condition {
              + test     = "NumericLessThan"
              + values   = [
                  + "1.2",
                ]
              + variable = "s3:TlsVersion"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.event_sourcing.module.s3_bucket_event_sourcing_producer.aws_s3_bucket.bucket will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "marshmallow-event-sourcing-ab-testing-staging"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "marshmallow-event-sourcing-ab-testing-staging"
        }
      + tags_all                    = {
          + "Name"           = "marshmallow-event-sourcing-ab-testing-staging"
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "ab-testing"
          + "team"           = "multi-product"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.event_sourcing.module.s3_bucket_event_sourcing_producer.aws_s3_bucket_lifecycle_configuration.lifecycle_configuration[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "lifecycle_configuration" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "standard_infrequent_access_archive"
          + status = "Enabled"

          + filter {
            }

          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
        }
    }

  # module.event_sourcing.module.s3_bucket_event_sourcing_producer.aws_s3_bucket_ownership_controls.ownership[0] will be created
  + resource "aws_s3_bucket_ownership_controls" "ownership" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # module.event_sourcing.module.s3_bucket_event_sourcing_producer.aws_s3_bucket_server_side_encryption_configuration.server_side_encryption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "server_side_encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.event_sourcing.module.s3_bucket_event_sourcing_producer.aws_s3_bucket_versioning.versioning[0] will be created
  + resource "aws_s3_bucket_versioning" "versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.event_sourcing.module.stage.snowflake_stage.this will be created
  + resource "snowflake_stage" "this" {
      + aws_external_id     = (known after apply)
      + copy_options        = "MATCH_BY_COLUMN_NAME = CASE_INSENSITIVE"
      + database            = "RAW"
      + file_format         = "TYPE = JSON NULL_IF = []"
      + id                  = (known after apply)
      + name                = "EVENT_SOURCING_AB_TESTING"
      + schema              = "AUTOMOTIVE"
      + snowflake_iam_user  = (known after apply)
      + storage_integration = "AUTOMOTIVE"
      + url                 = "s3://marshmallow-event-sourcing-ab-testing-staging/"
    }

  # module.event_sourcing.module.table["AbTestChangeEvent"].snowflake_table.this will be created
  + resource "snowflake_table" "this" {
      + change_tracking     = false
      + cluster_by          = []
      + data_retention_days = 7
      + database            = "RAW"
      + id                  = (known after apply)
      + name                = "AB_TESTING_ABTESTCHANGEEVENT"
      + owner               = (known after apply)
      + qualified_name      = (known after apply)
      + schema              = "AUTOMOTIVE"

      + column {
          + name     = "TEST_ID"
          + nullable = true
          + type     = "VARCHAR(16777216)"
        }
      + column {
          + name     = "TEST_VERSION"
          + nullable = true
          + type     = "NUMBER(38,0)"
        }
      + column {
          + name     = "EVENT_TIME"
          + nullable = true
          + type     = "VARCHAR(16777216)"
        }
      + column {
          + name     = "EVENT_DATA"
          + nullable = true
          + type     = "VARIANT"
        }
    }

  # module.event_sourcing.module.table["AbTestParticipantAllocationEvent"].snowflake_table.this will be created
  + resource "snowflake_table" "this" {
      + change_tracking     = false
      + cluster_by          = []
      + data_retention_days = 7
      + database            = "RAW"
      + id                  = (known after apply)
      + name                = "AB_TESTING_ABTESTPARTICIPANTALLOCATIONEVENT"
      + owner               = (known after apply)
      + qualified_name      = (known after apply)
      + schema              = "AUTOMOTIVE"

      + column {
          + name     = "PARTICIPANT_ID"
          + nullable = true
          + type     = "VARCHAR(16777216)"
        }
      + column {
          + name     = "PARTICIPANT_VERSION"
          + nullable = true
          + type     = "NUMBER(38,0)"
        }
      + column {
          + name     = "EVENT_TIME"
          + nullable = true
          + type     = "VARCHAR(16777216)"
        }
      + column {
          + name     = "EVENT_DATA"
          + nullable = true
          + type     = "VARIANT"
        }
    }

Plan: 30 to add, 0 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.event_sourcing.module.table.snowflake_table.this,
  on .terraform/modules/event_sourcing.table/snowflake/modules/table/main.tf line 21, in resource "snowflake_table" "this":
  21:   data_retention_days = 7

Use data_retention_time_in_days attribute instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: staging.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "staging.plan"

```
</details>